{
  "bio_1": {
    "name": "Eddy Massaad",
    "title": "Managing Partner",
    "description": "Edmond Massaad is the founder and managing director of i manage. Eddy’s passion for the F&B industry started when he was a part timing as a waiter during his college years studying biochemistry at the USEK university in Lebanon. Upon his graduation instead of pursuing a career as a biochemist Eddy opted to use his acquired knowledge and invest it into his Food & Beverage career aspirations. During the first years of his career he held an operations position at Riva Management Group and a supply chain management position at Zaatar w Zeit before taking the decision to completely focus on developing i manage.<br /><br />Eddy is a certified food & beverage cost controller, supply chain professional and Lead Auditor (ISO 22000), expert in strategic development, feasibility studies, franchising program development and investment planning for QSR & FSR concepts.<br /><br />Eddy is currently the managing partner of i manage, on the board of directors of i manage KSA, on the board of directors of Tabliyit Massaad, the fasted expanding Lebanese fast casual concept in Lebanon (20 outlets in 2 years), Acting General Manager of Kababji Grill, franchise developer for Urbanista, Mazzat, Malak al Tawouk and founder of Swiss Butter.",
    "image": "wp-content/themes/iManage/images/people/Georges-Khoury.jpg"
  },
  "bio_2": {
    "name": "Hady Barhouche",
    "title": "Senior Partner",
    "description": "Hady Barhouche is a hospitality management graduate at Cesar Ritz Switzerland/U.S.A, he brings years of food and beverage experience and knowledge to the leadership team with more than 15 years in the hospitality industry.<br /><br />Hady's background spans from large corporate owned hotels such as Hilton Worldwide and Hyatt Hotels, to large franchise restaurants producing over 15 million in annual revenues. He has led and executed several openings in U.S.A, Africa, Lebanon and the MENA region. He has held many positions in the hotel/restaurant industry including General Manager, Operations Manager, Food and Beverage Director, Banquet Manager, Food and Beverage Manager and Beverage Manager.<br /><br />Hady has been recognized throughout his career for food quality excellence, presentation, attention to details and his creativity in pairing menus with customer service excellent experience. Hady's commitment and desire to provide the ultimate customer experience is marked through his training skills, giving each project he touches a competitive edge within each market.",
    "image": "wp-content/themes/iManage/images/people/Sarah-Akl.jpg"
  },
  "bio_3": {
    "name": "Elie Zouein",
    "title": "Senior Partner",
    "description": "Elie is a hospitality management graduate, with 17 years experience in the Hospitality industry. Elie started his career in 1999 in five-star hotel chains: Gefinor Rotana, Le Royal, Al Safir and Mzar Intercontinental. He has also managed restaurants in Lebanon and the Gulf region, which shaped his skills in operations management through exposure of different types of restaurants, cuisines and across several markets and cultures.<br /><br />Elie is an absolute expert in project management and is master of bridging the gap between back office management and on the ground operations. His operational prowess is second to none and his decision making skills & capability to deliver exceptional results for clients make Elie a core part of the i manage success story.",
    "image": "wp-content/themes/iManage/images/people/Lama-Daccache.jpg"
  },
  "bio_4": {
    "name": "Jad Najem",
    "title": "Financial Advisor",
    "description": "Jad is a financial advisor with several years of experience in private equity at Colony Capital and Edge Capital. Prior joining the private equity environment, Jad worked for 3 years at the at HSBC and Byblos Bank Throughout his years of experience, Jad has been involved in different transactions (LBOs, MBOs, VC) covering the sourcing of investment opportunities including feasibility studies, due diligence, transaction valuation, and asset management. <br /><br />The sectors he has covered are numerous: Real estate (mega resorts development, residential projects), art, shopping malls and department stores, renewable energy, hotels, beach resorts, restaurants, fitness clubs, cinemas, health care, education, marinas, logistics, security, communication, advertising, wineries, transportation, and debt acquisitions.<br /><br />Jad holds a masters in management from École Supérieure des Affaires in Lebanon and a masters in international affairs from Poitiers University in France. He is also CVA accredited (Certified Valuation Analyst - CVA), and member of the International Association of Consultants, Valuators, and Analysts, IACVA.<br /><br /> Jad sits on the board of directors of several companies and is an instructor of financial management and financial analysis at the Holy Spirit University of Kaslik (USEK) in Lebanon.",
    "image": "wp-content/themes/iManage/images/people/Elie-Youssef.jpg"
  },
  "bio_5": {
    "name": "Bernard Massaad",
    "title": "Corporate Chef",
    "description": "Bernard Massaad is a culinary arts graduate at the Hospitality School in Beirut, with over 20 years of experience in food gastronomy. Started his career as a cook in Portemilio Suite Hotel in Kaslik – Lebanon in 1996. Moved up to head many kitchens with different cuisines until he settled for 9 years as an Executive Chef in Le Ragueneau, a French Bistro in Down Town – Beirut. <br ><br />In 2013, Chef Bernard moved to i manage as a corporate chef to be the driver behind all menu creations, kitchen management and system implementation projects under the company’s scope. He is a Food Carving Professional, with many artworks executed for banquets, events and special occasions, developed and lead many courses in Basic and Advanced Carving.<br /><br />Chef Bernard re-created the Café De Paris sauce, upon which the “Swiss Butter” concept was created with an aim for it to be operational in Beirut in early 2017.",
    "image": "wp-content/themes/iManage/images/people/Elie-Youssef.jpg"
  },
  "bio_6": {
    "name": "Nicholas Sfeir",
    "title": "Strategic Partner",
    "description": "Nicholas is a Learning & Development Executive driven by the passion of people development with +19 years of experience, as the Head of Learning & Development Department, specializing in corporate training and people development services. He was born in Lebanon in 1969. In 1993 he graduated from the Beirut University College with a bachelor degree in pharmacy. In 1994, Nicholas Moved to the United States and joined McDonalds as a Manager Trainee till 1996. He was promoted to Training Manager later assumed the role of Regional and National Training Manager for McDonalds in the Middle East until he left the company in 2009 after co-founding MCA People Solutions in 2008 in both Lebanon and Cyprus. <br /><br />In 2009 he joined Zaatar W Zeit as a Training Director with the goal of culture change. Nicholas founded the Lighthouse Coach in 2012 and established a strategic partnership with i manage in 2014 with the objective of designing innovative programs that instantly boost revenues, personality improvement, customer delight and employee motivation for the hospitality industry. <br /><br />Nicholas has trained well over 3000 professionals across multifunctional departments and his graduates include front line and managerial positions",
    "image": "wp-content/themes/iManage/images/people/Elie-Youssef.jpg"
  }
}
